ХМНПФ_Общее/DataProcessors/уп_ГрупповаяОбработкаПечатиРешенийЕВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ГрупповаяОбработкаПечатиРешенийЕВ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РешениеОЕдиновременнойВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РешениеОЕдиновременнойВыплате</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЕдиновременнойВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНаСчете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяВыплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоначислениеПоПереданномуВзносуИзПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_РазмерГП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_СрокПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ДатаГосПенсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ДатаСозданияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеУчитыватьДопВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаГарантированная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВосполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВозмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_ДатаВыплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФизическиеЛица</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестоРожденияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ФИОВРеестреПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_ГрупповаяОбработкаПечатиРешенийЕВ/Forms/уф_Форма/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("СформироватьСервер")
Функция ХМСформироватьСервер(ДокументРезультат)

	РабочаяДата=ТекущаяДата();
	СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, РабочаяДата);
	Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Объект.Организация, РабочаяДата);
	РасшифровкаПодписи = Руководители.РуководительПредставление;
	ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
	ПредставлениеОрганизации = СведенияОбОрг.Представление;

	КолОтчетов =100;

	НомерОтчета=1;
	флагОчисткиТабДокумента=0;

	Если Объект.ТипРешения = 0 Тогда
		Если Объект.Дата1>='20150101' Тогда
			//Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("ПФ_MXL_РешениеОВыплате2015");
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уп_РешениеОЕдиновременнойВыплате.ПФ_MXL_РешениеОВыплате2015");
		Иначе
			Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОВыплате");
		КонецЕсли;
	Иначе
		Если Объект.Дата1>='20150101' Тогда
			//Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("ПФ_MXL_РешениеОДопВыплате2015");
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уп_РешениеОЕдиновременнойВыплате.ПФ_MXL_РешениеОДопВыплате2015");
		Иначе
			Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОДопВыплате");
		КонецЕсли;
	КонецЕсли;

	ДокументРезультат.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_РешениеОЕдиновременнойВыплате.Ссылка,
	|	уп_РешениеОЕдиновременнойВыплате.Номер КАК НомерРешения,
	|	уп_РешениеОЕдиновременнойВыплате.Дата КАК Дата,
	|	уп_РешениеОЕдиновременнойВыплате.ДокументОснование,
	|	уп_РешениеОЕдиновременнойВыплате.ДокументОснование.Номер КАК НомерЗаявления,
	|	уп_РешениеОЕдиновременнойВыплате.ДокументОснование.Дата КАК ДатаЗаявления,
	|	уп_РешениеОЕдиновременнойВыплате.СуммаНаСчете,
	|	уп_РешениеОЕдиновременнойВыплате.Участник,
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
	|	уп_РешениеОЕдиновременнойВыплате.ДокументОснование.ДатаРегистрации КАК ДатаРегистрации,
	|	уп_РешениеОЕдиновременнойВыплате.ДоговорОПС.НомерЛицевогоСчета КАК НомерСчета,
	|	уп_РешениеОЕдиновременнойВыплате.ТипЕдиновременнойВыплаты,
	|	уп_РешениеОЕдиновременнойВыплате.Участник.уп_ФизЛицо КАК ФЛ,
	|	уп_РешениеОЕдиновременнойВыплате.ДоговорОПС.Филиал КАК Филиал
	|ПОМЕСТИТЬ ТаблицаРешений
	|ИЗ
	|	Документ.уп_РешениеОЕдиновременнойВыплате КАК уп_РешениеОЕдиновременнойВыплате
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
	|				&ДатаКон,
	|				ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						уп_РешениеОЕдиновременнойВыплате.Участник.уп_ФизЛицо
	|					ИЗ
	|						Документ.уп_РешениеОЕдиновременнойВыплате КАК уп_РешениеОЕдиновременнойВыплате
	|					ГДЕ
	|						уп_РешениеОЕдиновременнойВыплате.Дата МЕЖДУ &ДатаНач И &ДатаКон)) КАК ФИОФизЛицСрезПоследних
	|		ПО уп_РешениеОЕдиновременнойВыплате.Участник.уп_ФизЛицо = ФИОФизЛицСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	уп_РешениеОЕдиновременнойВыплате.Проведен = ИСТИНА
	|	И уп_РешениеОЕдиновременнойВыплате.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И уп_РешениеОЕдиновременнойВыплате.Организация = &Организация
	|	И уп_РешениеОЕдиновременнойВыплате.ДополнительнаяВыплата = &ДопВыплата
	|	И уп_РешениеОЕдиновременнойВыплате.ДоначислениеПоПереданномуВзносуИзПФР = &Доначисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	ФизическиеЛицаКонтактнаяИнформация.Тип КАК Тип,
	|	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
	|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Адрес
	|ПОМЕСТИТЬ ТаблицаАдресов
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаРешений.ФЛ
	|			ИЗ
	|				ТаблицаРешений)
	|	И ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
	|	И ФизическиеЛицаКонтактнаяИнформация.Вид = &Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРешений.Ссылка КАК Ссылка,
	|	ТаблицаРешений.НомерРешения КАК НомерРешения,
	|	ТаблицаРешений.Дата КАК Дата,
	|	ТаблицаРешений.ДокументОснование КАК ДокументОснование,
	|	ТаблицаРешений.НомерЗаявления КАК НомерЗаявления,
	|	ТаблицаРешений.ДатаЗаявления КАК ДатаЗаявления,
	|	ТаблицаРешений.СуммаНаСчете КАК СуммаНаСчете,
	|	ТаблицаРешений.Участник КАК Участник,
	|	ТаблицаРешений.ФИО КАК ФИО,
	|	ТаблицаРешений.ДатаРегистрации КАК ДатаРегистрации,
	|	ТаблицаРешений.НомерСчета КАК НомерСчета,
	|	ТаблицаРешений.ТипЕдиновременнойВыплаты КАК ТипЕдиновременнойВыплаты,
	|	ТаблицаРешений.Филиал КАК Филиал,
	|	ТаблицаРешений.ФЛ КАК ФЛ,
	|	ТаблицаАдресов.Адрес КАК Адрес
	|ИЗ
	|	ТаблицаРешений КАК ТаблицаРешений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаАдресов КАК ТаблицаАдресов
	|		ПО ТаблицаРешений.ФЛ = ТаблицаАдресов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	НомерРешения";

	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.Дата2));
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.Дата1));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Если Объект.ТипРешения = 0 Тогда
		Запрос.УстановитьПараметр("ДопВыплата", ЛОЖЬ);
		Запрос.УстановитьПараметр("Доначисление", ЛОЖЬ);
	ИначеЕсли Объект.ТипРешения = 1 Тогда
		Запрос.УстановитьПараметр("ДопВыплата", ИСТИНА);
		Запрос.УстановитьПараметр("Доначисление", ЛОЖЬ);
	Иначе
		Запрос.УстановитьПараметр("ДопВыплата", ЛОЖЬ);
		Запрос.УстановитьПараметр("Доначисление", ИСТИНА);
	КонецЕсли;
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);


	Результат = Запрос.Выполнить();
	Область = Макет.ПолучитьОбласть("Решение");
	#Удаление
	ОбластьКудаКому = Макет.ПолучитьОбласть("ОбластьКудаКому");
	#КонецУдаления
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Если флагОчисткиТабДокумента = 1 И Объект.ПечатьБезПредварительногоПросмотра Тогда
			//отправляем на печать
			ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			ДокументРезультат.Автомасштаб = Истина;
			ДокументРезультат.Напечатать(ЛОЖЬ);
			ДокументРезультат.Очистить();
			флагОчисткиТабДокумента = 0;
		КонецЕсли;	
		Область.Параметры.Заполнить(Выборка);
		Область.Параметры.Число = Формат(Выборка.Дата, "ДФ=дд");
		Область.Параметры.Месяц = Сред(Формат(Выборка.Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Выборка.Дата, "ДЛФ=дд")))-10);
		Область.Параметры.Год = Формат(Выборка.Дата, "ДФ=гггг");
		Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;

		Если Объект.ТипРешения = 0 Тогда	
			Если НЕ ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
				Область.Параметры.ДатаРегистрации = Выборка.ДатаЗаявления;
			КонецЕсли;
			Если Выборка.ТипЕдиновременнойВыплаты = 0 Тогда
				Область.Параметры.Подпункт = "а";
			Иначе
				Область.Параметры.Подпункт = "б";
			КонецЕсли;
		КонецЕсли;

		ПараметрыПрописиНаРусском = ВалютаПечати.ПараметрыПрописи;
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "1", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
		Область.Параметры.Сумма=Выборка.СуммаНаСчете; //ММВ Добавлена сумма числом (рядом с сумой прописью и отцентрировали)
		Область.Параметры.РублиПрописью = ЧислоПрописью(Цел(Выборка.СуммаНаСчете), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
		Область.Параметры.Копейки      = Формат(Цел((Выборка.СуммаНаСчете-Цел(Выборка.СуммаНаСчете))*100), "ЧЦ=2; ЧН=00");

		СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОЕдиновременнойВыплате.ПустаяСсылка(),Объект.Организация,Выборка.Филиал,Пользователи.ТекущийПользователь(),"Решение",РабочаяДата);
		Если ЗначениеЗаполнено(СведенияОбОтветственном.Фамилия) Тогда
			Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;
			Область.Параметры.ФИОРуководителя = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+". "+Лев(СведенияОбОтветственном.Отчество,1)+".";
		Иначе
			Область.Параметры.ФИОРуководителя = Руководители.РуководительПредставление;
			Область.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
		КонецЕсли;	
		//Область.Параметры.РасшифровкаПодписи = РасшифровкаПодписи;

		ДокументРезультат.Вывести(Область);
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		
		#Удаление
		Если Объект.ПечататьОборот Тогда
			Куда = Выборка.Адрес;
			Кому = Выборка.ФИО;
			ОбластьКудаКому.Рисунки.ТекстКудаКому.Текст = "Кому: "+Кому+Символы.ПС+"Куда: "+Куда;
			ДокументРезультат.Вывести(ОбластьКудаКому);
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        #КонецУдаления
	
		НомерОтчета = НомерОтчета+1;
		Если НомерОтчета>КолОтчетов Тогда
			флагОчисткиТабДокумента = 1;
			НомерОтчета = 1;
		КонецЕсли;	
	КонецЦикла;

	ДокументРезультат.ОтображатьСетку = Ложь;
	ДокументРезультат.Защита = Ложь;
	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.Автомасштаб = Истина;

	Возврат ДокументРезультат;

КонецФункции
